Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.AllowMultipleServiceSizes
State flag to allow multiple services to include the same size.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedServiceId
The mapped service identifier of the straight.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedProfileType
The mapped shape of the straight.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.IsMappedProductList
Are the mapped sizes for a product listed fabrication part.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedDepth
The mapped size for the depth of the straight.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedWidthDiameter
The mapped size for the width or diameter of the straight.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.GroupId
The group identifier of the straight.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.ServiceId
The service identifier of the straight.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.ProfileType
The shape of the straight.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.IsProductList
Are the sizes for a product listed fabrication part.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.Depth
The depth of the straight.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.WidthDiameter
The width or diameter of the straight.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.SizeString
The size display string for the straight that can be used by the user interface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.#ctor(System.String,System.Double,System.Double,System.Boolean,Autodesk.Revit.DB.ConnectorProfileType,System.Int32,System.Int32)
Creates a new instance of the FabricationPartSizeMap class.
size:
The size display string for the straight that can be used by the user interface.
widthDiameter:
The width or diameter of the straight.
depth:
The depth of the straight.
isProductList:
Set if the straight a product list or not.
profileType:
Set the shape of the straight.
serviceId:
Set the service identifier of the straight.
groupId:
Set the group identifier of the straight.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.#ctor(System.String,System.Double,System.Double,System.Boolean)
Creates a new instance of the FabricationPartSizeMap class.
size:
The size display string for the straight that can be used by the user interface.
widthDiameter:
The width or diameter of the straight.
depth:
The depth of the straight.
isProductList:
Set if the straight a product list or not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap
This class represents the fabrication part size map for straights allowing the sizes to be changed from a user interface for multiple straights with diffent sizes.
Remarks:
This is used as the data container for the FabricationPartSizeMapSet typeDef for crs:Set or Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap for ISet so a list of sizes can be generated to allow the user to select a size and map it to another.
Since:
2018.2